ServiceDesk/src/Catalogs/ВидыДеятельности/ВидыДеятельности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДеятельности</name>
  <predefined>
    <items>
      <name>Консультация</name>
      <description>1 - Консультация</description>
    </items>
    <items>
      <name>ИсправлениеОшибок</name>
      <description>2 - Ошибка разработчика</description>
    </items>
    <items>
      <name>Разработка</name>
      <description>3 - Разработка</description>
    </items>
    <items>
      <name>ОшибкиПользователей</name>
      <description>4 - Ошибка пользователя</description>
    </items>
    <items>
      <name>ОбработкаДанных</name>
      <description>5 - Обработка данных</description>
    </items>
  </predefined>
  <attributes>
    <name>ВремяРеакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПринятияВРаботу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРешенияИнцедента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Постоянная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ServiceDesk/src/Catalogs/Релизы/Релизы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Релизы</name>
  <attributes>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИнформационныеСистемы</name>
    <attributes>
      <name>ИнформационнаяСистема</name>
      <type>
        <types>CatalogRef.БазыДанных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ServiceDesk/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ДляНовыхЗаявок</name>
      <description>Для новых заявок</description>
    </items>
  </predefined>
  <attributes>
    <name>ID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SYNC_TIME</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аутентификация</name>
    <comment>Windows аутентификация</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аутсорсинг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесНаправление</name>
    <type>
      <types>EnumRef.БизнесНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяБаза</name>
    <type>
      <types>CatalogRef.БазыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>НеОтправлятьОповещенияНаПочту</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменитьПарольПриВходе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ServiceDesk/src/CommonModules/ЗаявкаПользователяВызовСервера/Module.bsl
Функция ПолучитьHTMLИзЗаявки(Заявка) Экспорт
	Возврат РаботаСHTML.ПолучитьHTMLИзЗаявки(Заявка);
КонецФункции

Функция ПолучитьРеквизитыЗаказчика(Заказчик) Экспорт
	СтруктураОтвета	= Новый Структура;
	СтруктураОтвета.Вставить("БизнесНаправление", Заказчик.Родитель.БизнесНаправление);
	СтруктураОтвета.Вставить("Организация", Заказчик.Организация);
	Возврат СтруктураОтвета;
КонецФункции 

Функция ИзменитьСостояниеЗарегистрированнойЗаявки(Заявка, ВидДеятельности) Экспорт
		
	Если ВидДеятельности = Справочники.ВидыДеятельности.Разработка Или ВидДеятельности = Справочники.ВидыДеятельности.ИсправлениеОшибок Тогда
		СостояниеЗаявки	= ОбщегоНазначенияСервер.ИзменитьСостояниеЗаявки(Заявка, "НаСогласовании");
	Иначе
		СостояниеЗаявки	= ОбщегоНазначенияСервер.ИзменитьСостояниеЗаявки(Заявка, "ПереданаКИсполнению");
	КонецЕсли;	
	
	Возврат СостояниеЗаявки;
	
КонецФункции

Функция КонтрольРелизовСервер(ИнформационнаяСистема, ДатаВыполнения = Неопределено, ВидДеятельности = Неопределено) Экспорт
	
	СтруктураОтвета	= Новый Структура;
	СтруктураОтвета.Вставить("КонтрольРелизов", ИнформационнаяСистема.КонтрольРелизов);
		
	Если ВидДеятельности = Справочники.ВидыДеятельности.Разработка Или ВидДеятельности = Справочники.ВидыДеятельности.ИсправлениеОшибок Тогда 
		
		Если ДатаВыполнения = Неопределено Или ДатаВыполнения = Дата(1,1,1) Тогда
			ДатаВыполнения	= ТекущаяДатаСеанса();
		КонецЕсли;	
		
		пЗапрос	= Новый Запрос;
		пЗапрос.Текст	= "ВЫБРАТЬ ПЕРВЫЕ 1
		|	РелизыИнформационныеСистемы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Релизы.ИнформационныеСистемы КАК РелизыИнформационныеСистемы
		|ГДЕ
		|	РелизыИнформационныеСистемы.ИнформационнаяСистема = &ИнформационнаяСистема
		|	И РелизыИнформационныеСистемы.Ссылка.ДатаВыхода >= &ДатаВыхода
		|
		|УПОРЯДОЧИТЬ ПО
		|	РелизыИнформационныеСистемы.Ссылка.ДатаВыхода";
		
		пЗапрос.УстановитьПараметр("ИнформационнаяСистема", ИнформационнаяСистема);
		пЗапрос.УстановитьПараметр("ДатаВыхода", КонецМесяца(ДатаВыполнения)+10);
		
		РезультатЗапроса	= пЗапрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда 
			СтруктураОтвета.Вставить("Релиз", Справочники.Релизы.ПустаяСсылка());
		Иначе 
			Выборка	= РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			СтруктураОтвета.Вставить("Релиз", Выборка.Ссылка);		
		КонецЕсли;
		
	Иначе		
		СтруктураОтвета.Вставить("Релиз", Справочники.Релизы.ПустаяСсылка());	
	КонецЕсли;

	Возврат СтруктураОтвета;
	
КонецФункции

Функция ПроверитьИсториюСогласования(Заявка) Экспорт
	Возврат БизнесПроцессы.ОбработкаЗаявки.ПроверитьИсториюСогласования(Заявка);
КонецФункции

Процедура ВидДеятельностиПриИзменении(Объект) Экспорт	
	Если Объект.ВидДеятельности	<> Справочники.ВидыДеятельности.Разработка И Объект.ВидДеятельности	<> Справочники.ВидыДеятельности.ИсправлениеОшибок Тогда
		Объект.Релиз		= Справочники.Релизы.ПустаяСсылка();
		Объект.Тестировщик	= Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;	
КонецПроцедуры

Процедура ДобавитьВУРВСервер(Задача, Время) Экспорт
	ПередаваемыеПараметры	= Новый Массив;
	ПередаваемыеПараметры.Добавить(Задача);
	ПередаваемыеПараметры.Добавить(Время);
	ПередаваемыеПараметры.Добавить(ПараметрыСеанса.ТекущийПользователь);
	ФоновыеЗадания.Выполнить("Привилегированный.ДобавитьЗадачуВУРВ", ПередаваемыеПараметры, Новый УникальныйИдентификатор, "Добавить задачу в УРВ");
КонецПроцедуры
